#+TITLE: Multimessenger Astronomy
#+AUTHOR: Daniel Williams
#+LATEX_CLASS: tufte-handout

{{{newthought(The advent of the first binary neutron star observation)}}}, {{{abbr(GW170817)}}}, to be observed by {{{abbr(gw)}}} detectors served as the advent of a new era in observational astrophysics, with {{{abbr(gw)}}} now able to sit alongside conventional electromagnetic observations to probe the astrophysical nature of some of the most extreme events in the universe.


**** Link for a command with one option
The option is placed after a ; in the link description.
#+name: latex-opt-link
#+begin_src emacs-lisp
(org-add-link-type
 "latex-opt" nil
 (lambda (path desc format)
   (when (eq format 'latex)
     (let* ((desc-list (split-string desc ";"))
            (opt (nth 1 desc-list))
            (arg (nth 0 desc-list)))
       (format "\\%s%s{%s}" path
               (if (equal "" opt) opt (format "[%s]" opt))
               arg)))))
#+end_src

#+results: latex-opt-link
| lambda | (path desc format) | (when (eq format (quote latex)) (let* ((desc-list (split-string desc ;)) (opt (nth 1 desc-list)) (arg (nth 0 desc-list))) (format \%s%s{%s} path (if (equal  opt) opt (format [%s] opt)) arg))) |

